Dlubal.TimberPro.ITimberProResults
Interface for working with module results.

Dlubal.TimberPro.ITimberProResults.GetDesignsByLoad
Gets array of design by loads.
Returns: Array of results.

Dlubal.TimberPro.ITimberProResults.GetDesignsByCrossSection
Gets array of design by cross-section.
Returns: Array of results.

Dlubal.TimberPro.ITimberProResults.GetDesignsBySetOfMembers
Gets array of design by set of members.
Returns: Array of results.

Dlubal.TimberPro.ITimberProResults.GetDesignsByMember
Gets array of design by members.
Returns: Array of results.

Dlubal.TimberPro.ITimberProResults.GetDesignsByXLocation
Gets array of design by x location.
Returns: Array of results.

Dlubal.TimberPro.ITimberProResults.GetInternalForcesByMember
Gets array of internal forces by member.
Returns: Array of results.

Dlubal.TimberPro.ITimberProResults.GetInternalForcesBySetOfMembers
Gets array of internal forces by set of members.
Returns: Array of results.

Dlubal.TimberPro.ITimberProResults.GetMemberSlendernesses
Gets array of member slendernesses.
Returns: Array of results.

Dlubal.TimberPro.ITimberProResults.GetPartsListByMember
Gets array of parts by member.
Returns: Array of results.

Dlubal.TimberPro.ITimberProResults.GetPartsListBySetOfMembers
Gets array of parts by set of members.
Returns: Array of results.